Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/pic32cm_sg00_curioisty_pro_trustzone/pic32cm_sg00_secure/src/packs/PIC32CM5112SG00100_DFP/component/supc.h
/* -------- SUPC_VREGCTRL : (SUPC Offset: 0x1C) (R/W 32) VREG Control -------- */
#define SUPC_VREGCTRL_RESETVALUE              _UINT32_(0x04)                                       /*  (SUPC_VREGCTRL) VREG Control  Reset Value */

#define SUPC_VREGCTRL_VREGOUT_Pos             _UINT32_(0)                                          /* (SUPC_VREGCTRL) VREG Output Control in RUN mode only. Enable by production fuse by CALSUPC.VREGOUTEN Position */
#define SUPC_VREGCTRL_VREGOUT_Msk             (_UINT32_(0x3) << SUPC_VREGCTRL_VREGOUT_Pos)         /* (SUPC_VREGCTRL) VREG Output Control in RUN mode only. Enable by production fuse by CALSUPC.VREGOUTEN Mask */
#define SUPC_VREGCTRL_VREGOUT(value)          (SUPC_VREGCTRL_VREGOUT_Msk & (_UINT32_(value) << SUPC_VREGCTRL_VREGOUT_Pos)) /* Assignment of value for VREGOUT in the SUPC_VREGCTRL register */
#define   SUPC_VREGCTRL_VREGOUT_1p2v_Val      _UINT32_(0x0)                                        /* (SUPC_VREGCTRL) In Active mode, VDDCORE_RAM, VDDCORE_BU, VDDCORE_SW and optionnaly VDDCORE_PLL USB are set to 1.2v.  */
#define   SUPC_VREGCTRL_VREGOUT_1p0v_Val      _UINT32_(0x1)                                        /* (SUPC_VREGCTRL) In Active mode, VDDCORE_RAM, VDDCORE_BU, VDDCORE_SW and optionnaly VDDCORE_PLL USB are set to 1.0v.  */
#define   SUPC_VREGCTRL_VREGOUT_0p8v_Val      _UINT32_(0x2)                                        /* (SUPC_VREGCTRL) In Active mode, VDDCORE_RAM, VDDCORE_BU, VDDCORE_SW and optionnaly VDDCORE_PLL USB are set to 0.8v.  */
#define SUPC_VREGCTRL_VREGOUT_1p2v            (SUPC_VREGCTRL_VREGOUT_1p2v_Val << SUPC_VREGCTRL_VREGOUT_Pos) /* (SUPC_VREGCTRL) In Active mode, VDDCORE_RAM, VDDCORE_BU, VDDCORE_SW and optionnaly VDDCORE_PLL USB are set to 1.2v. Position */
#define SUPC_VREGCTRL_VREGOUT_1p0v            (SUPC_VREGCTRL_VREGOUT_1p0v_Val << SUPC_VREGCTRL_VREGOUT_Pos) /* (SUPC_VREGCTRL) In Active mode, VDDCORE_RAM, VDDCORE_BU, VDDCORE_SW and optionnaly VDDCORE_PLL USB are set to 1.0v. Position */
#define SUPC_VREGCTRL_VREGOUT_0p8v            (SUPC_VREGCTRL_VREGOUT_0p8v_Val << SUPC_VREGCTRL_VREGOUT_Pos) /* (SUPC_VREGCTRL) In Active mode, VDDCORE_RAM, VDDCORE_BU, VDDCORE_SW and optionnaly VDDCORE_PLL USB are set to 0.8v. Position */
#define SUPC_VREGCTRL_OFFSTDBY_Pos            _UINT32_(2)                                          /* (SUPC_VREGCTRL) Off in Standby Control for VREGSW[N-1]. Useful for Riverside only. Position */
#define SUPC_VREGCTRL_OFFSTDBY_Msk            (_UINT32_(0x1) << SUPC_VREGCTRL_OFFSTDBY_Pos)        /* (SUPC_VREGCTRL) Off in Standby Control for VREGSW[N-1]. Useful for Riverside only. Mask */
#define SUPC_VREGCTRL_OFFSTDBY(value)         (SUPC_VREGCTRL_OFFSTDBY_Msk & (_UINT32_(value) << SUPC_VREGCTRL_OFFSTDBY_Pos)) /* Assignment of value for OFFSTDBY in the SUPC_VREGCTRL register */
#define   SUPC_VREGCTRL_OFFSTDBY_OFF_Val      _UINT32_(0x0)                                        /* (SUPC_VREGCTRL) In standby mode, VREGSW1,2,3 are OFF  */
#define   SUPC_VREGCTRL_OFFSTDBY_ON_Val       _UINT32_(0x1)                                        /* (SUPC_VREGCTRL) In standby mode, VREGSW1,2,3 are ON  */
#define SUPC_VREGCTRL_OFFSTDBY_OFF            (SUPC_VREGCTRL_OFFSTDBY_OFF_Val << SUPC_VREGCTRL_OFFSTDBY_Pos) /* (SUPC_VREGCTRL) In standby mode, VREGSW1,2,3 are OFF Position */
#define SUPC_VREGCTRL_OFFSTDBY_ON             (SUPC_VREGCTRL_OFFSTDBY_ON_Val << SUPC_VREGCTRL_OFFSTDBY_Pos) /* (SUPC_VREGCTRL) In standby mode, VREGSW1,2,3 are ON Position */
#define SUPC_VREGCTRL_LVSTDBY_Pos             _UINT32_(4)                                          /* (SUPC_VREGCTRL) Low Voltage Standby Enable Position */
#define SUPC_VREGCTRL_LVSTDBY_Msk             (_UINT32_(0x1) << SUPC_VREGCTRL_LVSTDBY_Pos)         /* (SUPC_VREGCTRL) Low Voltage Standby Enable Mask */
#define SUPC_VREGCTRL_LVSTDBY(value)          (SUPC_VREGCTRL_LVSTDBY_Msk & (_UINT32_(value) << SUPC_VREGCTRL_LVSTDBY_Pos)) /* Assignment of value for LVSTDBY in the SUPC_VREGCTRL register */
#define   SUPC_VREGCTRL_LVSTDBY_1p2v_Val      _UINT32_(0x0)                                        /* (SUPC_VREGCTRL) In standby mode, VDDCORE_BU, VDDCORE_RAM, VDDCORE_SW and optionnaly VDDCOREUSB/PLL are set to 1.2v.  */
#define   SUPC_VREGCTRL_LVSTDBY_0p8v_Val      _UINT32_(0x1)                                        /* (SUPC_VREGCTRL) In standby mode, VDDCORE_BU, VDDCORE_RAM, VDDCORE_SW and optionnaly VDDCOREUSB/PLL are set to 0.8v.  */
#define SUPC_VREGCTRL_LVSTDBY_1p2v            (SUPC_VREGCTRL_LVSTDBY_1p2v_Val << SUPC_VREGCTRL_LVSTDBY_Pos) /* (SUPC_VREGCTRL) In standby mode, VDDCORE_BU, VDDCORE_RAM, VDDCORE_SW and optionnaly VDDCOREUSB/PLL are set to 1.2v. Position */
#define SUPC_VREGCTRL_LVSTDBY_0p8v            (SUPC_VREGCTRL_LVSTDBY_0p8v_Val << SUPC_VREGCTRL_LVSTDBY_Pos) /* (SUPC_VREGCTRL) In standby mode, VDDCORE_BU, VDDCORE_RAM, VDDCORE_SW and optionnaly VDDCOREUSB/PLL are set to 0.8v. Position */
#define SUPC_VREGCTRL_LVHIB_Pos               _UINT32_(5)                                          /* (SUPC_VREGCTRL) Low Voltage Hibernate Enable Position */
#define SUPC_VREGCTRL_LVHIB_Msk               (_UINT32_(0x1) << SUPC_VREGCTRL_LVHIB_Pos)           /* (SUPC_VREGCTRL) Low Voltage Hibernate Enable Mask */
#define SUPC_VREGCTRL_LVHIB(value)            (SUPC_VREGCTRL_LVHIB_Msk & (_UINT32_(value) << SUPC_VREGCTRL_LVHIB_Pos)) /* Assignment of value for LVHIB in the SUPC_VREGCTRL register */
#define   SUPC_VREGCTRL_LVHIB_1p2v_Val        _UINT32_(0x0)                                        /* (SUPC_VREGCTRL) In Hibernate mode, VDDCORE_BU and VDDCORE_RAM are set to 1.2v.  */
#define   SUPC_VREGCTRL_LVHIB_0p8v_Val        _UINT32_(0x1)                                        /* (SUPC_VREGCTRL) In Hibernate mode, VDDCORE_BU and VDDCORE_RAM are set to 0.8v  */
#define SUPC_VREGCTRL_LVHIB_1p2v              (SUPC_VREGCTRL_LVHIB_1p2v_Val << SUPC_VREGCTRL_LVHIB_Pos) /* (SUPC_VREGCTRL) In Hibernate mode, VDDCORE_BU and VDDCORE_RAM are set to 1.2v. Position */
#define SUPC_VREGCTRL_LVHIB_0p8v              (SUPC_VREGCTRL_LVHIB_0p8v_Val << SUPC_VREGCTRL_LVHIB_Pos) /* (SUPC_VREGCTRL) In Hibernate mode, VDDCORE_BU and VDDCORE_RAM are set to 0.8v Position */
#define SUPC_VREGCTRL_CPEN_Pos                _UINT32_(8)                                          /* (SUPC_VREGCTRL) Charge Pump Enable and Auto-enable. Position */
#define SUPC_VREGCTRL_CPEN_Msk                (_UINT32_(0x3) << SUPC_VREGCTRL_CPEN_Pos)            /* (SUPC_VREGCTRL) Charge Pump Enable and Auto-enable. Mask */
#define SUPC_VREGCTRL_CPEN(value)             (SUPC_VREGCTRL_CPEN_Msk & (_UINT32_(value) << SUPC_VREGCTRL_CPEN_Pos)) /* Assignment of value for CPEN in the SUPC_VREGCTRL register */
#define SUPC_VREGCTRL_ULDOEN_Pos              _UINT32_(12)                                         /* (SUPC_VREGCTRL) User LDO Voltage Regulator Enable Position */
#define SUPC_VREGCTRL_ULDOEN_Msk              (_UINT32_(0x1) << SUPC_VREGCTRL_ULDOEN_Pos)          /* (SUPC_VREGCTRL) User LDO Voltage Regulator Enable Mask */
#define SUPC_VREGCTRL_ULDOEN(value)           (SUPC_VREGCTRL_ULDOEN_Msk & (_UINT32_(value) << SUPC_VREGCTRL_ULDOEN_Pos)) /* Assignment of value for ULDOEN in the SUPC_VREGCTRL register */
#define SUPC_VREGCTRL_ULDOSTDBY_Pos           _UINT32_(13)                                         /* (SUPC_VREGCTRL) User LDO Voltage Regulator Configuration Position */
#define SUPC_VREGCTRL_ULDOSTDBY_Msk           (_UINT32_(0x1) << SUPC_VREGCTRL_ULDOSTDBY_Pos)       /* (SUPC_VREGCTRL) User LDO Voltage Regulator Configuration Mask */
#define SUPC_VREGCTRL_ULDOSTDBY(value)        (SUPC_VREGCTRL_ULDOSTDBY_Msk & (_UINT32_(value) << SUPC_VREGCTRL_ULDOSTDBY_Pos)) /* Assignment of value for ULDOSTDBY in the SUPC_VREGCTRL register */
#define   SUPC_VREGCTRL_ULDOSTDBY_OFFINSTDBY_Val _UINT32_(0x0)                                        /* (SUPC_VREGCTRL) Regulator is OFF while in sleep mode equal or deeper than standby mode. It is OFF in hibernate and backup mode as well.  */
#define   SUPC_VREGCTRL_ULDOSTDBY_ONINSTDBY_Val _UINT32_(0x1)                                        /* (SUPC_VREGCTRL) Regulator is ON in Standby mode. is OFF from Hibernate mode. It is OFF in backup mode as well.  */
#define SUPC_VREGCTRL_ULDOSTDBY_OFFINSTDBY    (SUPC_VREGCTRL_ULDOSTDBY_OFFINSTDBY_Val << SUPC_VREGCTRL_ULDOSTDBY_Pos) /* (SUPC_VREGCTRL) Regulator is OFF while in sleep mode equal or deeper than standby mode. It is OFF in hibernate and backup mode as well. Position */
#define SUPC_VREGCTRL_ULDOSTDBY_ONINSTDBY     (SUPC_VREGCTRL_ULDOSTDBY_ONINSTDBY_Val << SUPC_VREGCTRL_ULDOSTDBY_Pos) /* (SUPC_VREGCTRL) Regulator is ON in Standby mode. is OFF from Hibernate mode. It is OFF in backup mode as well. Position */
#define SUPC_VREGCTRL_ULDOLEVEL_Pos           _UINT32_(14)                                         /* (SUPC_VREGCTRL) User LDO Voltage Level Selection Position */
#define SUPC_VREGCTRL_ULDOLEVEL_Msk           (_UINT32_(0x3) << SUPC_VREGCTRL_ULDOLEVEL_Pos)       /* (SUPC_VREGCTRL) User LDO Voltage Level Selection Mask */
#define SUPC_VREGCTRL_ULDOLEVEL(value)        (SUPC_VREGCTRL_ULDOLEVEL_Msk & (_UINT32_(value) << SUPC_VREGCTRL_ULDOLEVEL_Pos)) /* Assignment of value for ULDOLEVEL in the SUPC_VREGCTRL register */
#define   SUPC_VREGCTRL_ULDOLEVEL_1p2v_Val    _UINT32_(0x0)                                        /* (SUPC_VREGCTRL) Vout = 1.2v  */
#define   SUPC_VREGCTRL_ULDOLEVEL_1p5v_Val    _UINT32_(0x1)                                        /* (SUPC_VREGCTRL) Vout = 1.5v  */
#define   SUPC_VREGCTRL_ULDOLEVEL_1p8v_Val    _UINT32_(0x2)                                        /* (SUPC_VREGCTRL) Vout = 1.8v  */
#define   SUPC_VREGCTRL_ULDOLEVEL_2p5v_Val    _UINT32_(0x3)                                        /* (SUPC_VREGCTRL) Vout = 2.5v  */
#define SUPC_VREGCTRL_ULDOLEVEL_1p2v          (SUPC_VREGCTRL_ULDOLEVEL_1p2v_Val << SUPC_VREGCTRL_ULDOLEVEL_Pos) /* (SUPC_VREGCTRL) Vout = 1.2v Position */
#define SUPC_VREGCTRL_ULDOLEVEL_1p5v          (SUPC_VREGCTRL_ULDOLEVEL_1p5v_Val << SUPC_VREGCTRL_ULDOLEVEL_Pos) /* (SUPC_VREGCTRL) Vout = 1.5v Position */
#define SUPC_VREGCTRL_ULDOLEVEL_1p8v          (SUPC_VREGCTRL_ULDOLEVEL_1p8v_Val << SUPC_VREGCTRL_ULDOLEVEL_Pos) /* (SUPC_VREGCTRL) Vout = 1.8v Position */
#define SUPC_VREGCTRL_ULDOLEVEL_2p5v          (SUPC_VREGCTRL_ULDOLEVEL_2p5v_Val << SUPC_VREGCTRL_ULDOLEVEL_Pos) /* (SUPC_VREGCTRL) Vout = 2.5v Position */
#define SUPC_VREGCTRL_AVREGEN_Pos             _UINT32_(16)                                         /* (SUPC_VREGCTRL) Additional Voltage Regulator Enable Position */
#define SUPC_VREGCTRL_AVREGEN_Msk             (_UINT32_(0x1) << SUPC_VREGCTRL_AVREGEN_Pos)         /* (SUPC_VREGCTRL) Additional Voltage Regulator Enable Mask */
#define SUPC_VREGCTRL_AVREGEN(value)          (SUPC_VREGCTRL_AVREGEN_Msk & (_UINT32_(value) << SUPC_VREGCTRL_AVREGEN_Pos)) /* Assignment of value for AVREGEN in the SUPC_VREGCTRL register */
#define SUPC_VREGCTRL_AVREGSTDBY_Pos          _UINT32_(24)                                         /* (SUPC_VREGCTRL) Additional Voltage Regulator Configuration Position */
#define SUPC_VREGCTRL_AVREGSTDBY_Msk          (_UINT32_(0x1) << SUPC_VREGCTRL_AVREGSTDBY_Pos)      /* (SUPC_VREGCTRL) Additional Voltage Regulator Configuration Mask */
#define SUPC_VREGCTRL_AVREGSTDBY(value)       (SUPC_VREGCTRL_AVREGSTDBY_Msk & (_UINT32_(value) << SUPC_VREGCTRL_AVREGSTDBY_Pos)) /* Assignment of value for AVREGSTDBY in the SUPC_VREGCTRL register */
#define   SUPC_VREGCTRL_AVREGSTDBY_OFFINSTDBY_Val _UINT32_(0x0)                                        /* (SUPC_VREGCTRL) Regulator is OFF while in sleep mode equal or deeper than standby mode. It is OFF in hibernate and backup mode as well.  */
#define   SUPC_VREGCTRL_AVREGSTDBY_ONINSTDBY_Val _UINT32_(0x1)                                        /* (SUPC_VREGCTRL) Regulator is ON in Standby mode if AVREGEN bit is set. is OFF from Hibernate mode. It is OFF in backup mode as well.  */
#define SUPC_VREGCTRL_AVREGSTDBY_OFFINSTDBY   (SUPC_VREGCTRL_AVREGSTDBY_OFFINSTDBY_Val << SUPC_VREGCTRL_AVREGSTDBY_Pos) /* (SUPC_VREGCTRL) Regulator is OFF while in sleep mode equal or deeper than standby mode. It is OFF in hibernate and backup mode as well. Position */
#define SUPC_VREGCTRL_AVREGSTDBY_ONINSTDBY    (SUPC_VREGCTRL_AVREGSTDBY_ONINSTDBY_Val << SUPC_VREGCTRL_AVREGSTDBY_Pos) /* (SUPC_VREGCTRL) Regulator is ON in Standby mode if AVREGEN bit is set. is OFF from Hibernate mode. It is OFF in backup mode as well. Position */
#define SUPC_VREGCTRL_SRAM_VLD_Pos            _UINT32_(30)                                         /* (SUPC_VREGCTRL) SRAM VALID Status Bit Position */
#define SUPC_VREGCTRL_SRAM_VLD_Msk            (_UINT32_(0x1) << SUPC_VREGCTRL_SRAM_VLD_Pos)        /* (SUPC_VREGCTRL) SRAM VALID Status Bit Mask */
#define SUPC_VREGCTRL_SRAM_VLD(value)         (SUPC_VREGCTRL_SRAM_VLD_Msk & (_UINT32_(value) << SUPC_VREGCTRL_SRAM_VLD_Pos)) /* Assignment of value for SRAM_VLD in the SUPC_VREGCTRL register */
#define SUPC_VREGCTRL_BKUP_VLD_Pos            _UINT32_(31)                                         /* (SUPC_VREGCTRL) Backup Domain Valid Status Bit Position */
#define SUPC_VREGCTRL_BKUP_VLD_Msk            (_UINT32_(0x1) << SUPC_VREGCTRL_BKUP_VLD_Pos)        /* (SUPC_VREGCTRL) Backup Domain Valid Status Bit Mask */
#define SUPC_VREGCTRL_BKUP_VLD(value)         (SUPC_VREGCTRL_BKUP_VLD_Msk & (_UINT32_(value) << SUPC_VREGCTRL_BKUP_VLD_Pos)) /* Assignment of value for BKUP_VLD in the SUPC_VREGCTRL register */
#define SUPC_VREGCTRL_Msk                     _UINT32_(0xC101F337)                                 /* (SUPC_VREGCTRL) Register Mask  */


